{
    "Password Reset Needed": "To reset your password, click on 'Forgot Password' on the login screen. Enter your registered email and follow the instructions sent to your email. If you do not receive the reset email, please check your spam or junk folder. If the issue persists, try again after a few minutes or contact support.",
    "Login Problem": "If you’re unable to log in, ensure that you’re entering the correct email and password. Check if the Caps Lock key is off. If you’ve forgotten your password, use the 'Forgot Password' link to reset it. If you’re still unable to log in, contact our support team for assistance.",
    "Payment Failure": "Payment failures can happen due to insufficient balance, incorrect card details, or network issues. Please check your payment method and try again. If the amount was debited but not reflected, contact your bank or our support team with your transaction ID.",
    "App Download Issue": "Ensure you have a stable internet connection and enough storage space. Try clearing cache of your app store and restarting your device. If the issue continues, download from our official website or contact support.",
    "Refund Request": "We’re sorry to hear you want a refund. Refunds are processed according to our refund policy. Please provide your order ID and reason for refund. Once reviewed, the amount will be credited within 5-7 business days.",
    "Account Locked": "Your account may have been locked due to multiple failed login attempts. Please wait 30 minutes before trying again or reset your password using 'Forgot Password'. Contact support if the issue continues.",
    "Two-Factor Authentication Issue": "Ensure you have access to the registered mobile/email where the OTP or verification code is sent. If you're not receiving the code, check your network or try resending. For further help, contact support.",
    "Email Not Received": "Please check your spam or junk folder. Make sure you entered the correct email address. If the problem persists, try resending or contact support.",
    "App Crash": "Make sure you are using the latest version of the app. Try clearing app cache or reinstalling the app. If the problem continues, send us details of your device and OS version.",
    "Slow Performance": "Close background apps and ensure your device has sufficient memory. Check your internet connection. If the issue persists, reinstall the app or update to the latest version.",
    "Feature Request": "We value your feedback! Please describe the feature you’d like to see and how it would help you. Our team regularly reviews suggestions for future updates.",
    "Subscription Cancellation": "To cancel your subscription, go to Account Settings > Billing > Cancel Subscription. Your access will remain active until the end of the current billing cycle.",
    "Invoice Request": "You can download your invoices from the Billing section of your account. If you need a custom invoice, contact support with your billing details.",
    "Duplicate Charges": "Check your bank statement to confirm duplicate charges. If you see two completed transactions, contact support with your order ID and both transaction references for a refund.",
    "Order Not Delivered": "We’re sorry your order hasn’t arrived. Please check the estimated delivery time. If it's past the date, contact our delivery team with your order ID.",
    "Wrong Item Delivered": "Apologies for the mix-up. Share a photo of the received item along with your order ID. Our team will arrange for a replacement or refund.",
    "Update Personal Info": "You can update your email, phone number, or address from your account settings. For any issue, reach out to support with proof of identity.",
    "App Compatibility Issue": "Ensure your device meets the app's minimum system requirements. Try updating your OS or contact support with your device model and OS version.",
    "Bug Report": "Thank you for reporting. Please describe the issue, steps to reproduce it, and your device details. Our dev team will investigate.",
    "Feedback or Complaint": "We appreciate all feedback. Please be specific about your concern or suggestion so we can address it properly.",
    "Request for Documentation": "Our user guides and developer documentation are available on our Help Center. If you need something specific, let us know.",
    "API Access Request": "To request API access, please fill out the form in the Developer section of our site. You’ll receive credentials within 1-2 business days.",
    "Data Export Request": "To export your data, go to Account Settings > Data > Export. You will receive a download link via email. Contact support for custom exports.",
    "GDPR/Privacy Concern": "We take your privacy seriously. You can request data deletion or review by contacting our Data Protection Officer at privacy@ourcompany.com."
}